package SecondVideoCourse;

public class NumberSystem {
    public static void main(String[] args) {
        int a1 = 60;
        int a2 = 0B111100;

        int a3 = 074;

        int a4 = 0x3c;
        int a5 = 0X3C;
        System.out.println(a5);

        int a7 = 1_000_000;



    }

}
//Decimal Десятеричная система пишется щт 0 до 10. пример:10,12,99
//Binary двоичной системе все завязано на нулях и единицах пример:0,100,1001,11001
//Octal восьмеричной системе пишем цифры от 1 до 7 пример: 57,42 а 92 в восьмеричном системе нет
//Hexadecimal шестнадцатеричной системе исп.цифры от 0 до 9 а также латинские буквы ABCDEF пример: АО9В1F

                     //Где можно и где нельзя использовать символы!!!

//underscore нужен чтобы было легко считать цифры и они допускаются в коде чтобы он был читабельнее
//underscore не будут видны на дисплее их можно использовать много раз
//underscore нельзя использовать в начале и в конце числа
//underscore нельзя использовать до и после дробных числах
//underscore нельзя использовать до и после букв L,I,F,f,D,d
//underscore нельзя использовать до и после 0X,0x,0B,0b